# -*- coding: utf-8 -*
# from flyai.dataset import Dataset
from model import Model
from dataset import  Dataset

from processor import Processor

dataset = Dataset(train_batch=128, val_batch=64, split_ratio=0.9, )
model = Model(dataset)
#
# predict = model.predict(text="您好！我们这边是施华洛世奇鄞州万达店！您是我们尊贵的会员，特意邀请您参加我们x.x-x.x的三八女人节活动！满xxxx元享晶璨花漾丝巾")
# print(predict)

labels = [0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,1,]
texts =[
{'text':'目前A股的量能尚未缩窄至可供稳定反弹的地步'},
{'text':'专利让农业部南京农业机械化研究所申请'},
{'text':'11日至12日将出现偏东转东北大风：南部和东部地区风力8到10级、其他地区7到9级'},
{'text':'33岁的布泽尔在NBA征战了13个赛季'},
{'text':'大半夜的我爹起床打开电脑玩起了连连看'},
{'text':'您好！我们这边是施华洛世奇鄞州万达店！您是我们尊贵的会员，特意邀请您参加我们x.x-x.x的三八女人节活动！满xxxx元享晶璨花漾丝巾'},
{'text':'『榆林查处“四风”和腐败案件3500余人受处分』'},
{'text':'2、福建省2015年本科一批常规志愿投档最低分出炉'},
{'text':'我趁机械潜艇鱼进入维修站的一刻果断出手'},
{'text':'1957年获得美国麻省理著名银器制造商“陶尔银器”和伊利诺理工大学共同提供的奖学金赴美深造'},
{'text':'2015年8月8日20许脱逃的省未成年犯管教所服刑人员张云明'},
{'text':'依法作出拘留10天的处罚决定'},
{'text':'业务范围包括证券、基金、期货、银'},
{'text':'徐州鼓楼法院公开开庭审理一起赡养费纠纷案'},
{'text':'预计2015年底单月成交可达10000辆'},
{'text':'期待阿里音乐成为世界级音乐机构'},
{'text':'投资者对物价实际涨幅往往也会估计过高'},
{'text':'我在百度手机卫士中获得了探索专家称号'},
{'text':'天亮了……涨价是政府的职能……欢呼吧'},
{'text':'江苏省科协与克州科协就对口支援的有关事项签定了正式协议'},
{'text':'热求得飞机儿热热死妈几个仙人'},
{'text':'德国之声『时政风云：浙江继续……'},
{'text':'传统的红娘+互联网有了世纪佳缘'},
{'text':'我拍那些电影广告电视剧所有人都知道我是谁好吗我用的着戴面具吗杀人偿命判刑死刑死郑露我想说的是你花的我的钱现在在王丹丹那里面写我杀我杀家人判刑死刑死'},
{'text':'当你遇见强奸犯时如何让他立刻变小女：进去了吗'},
{'text':'每个月的信用卡都让我很伤'},
{'text':'从花千骨到三生三世十里桃花再到华胥引'},
{'text':'西藏佛塔的产生和发展有着极其复杂的历史背景和深邃的宗教文化内涵'},
{'text':'新北区中海锦瓏湾均价5500'},
{'text':'人与人之间完全没有诚信可言了'},
{'text':'但是它的装修风格是我最爱的'},
{'text':'永远忘不了上年7月22日南京虹悦城的见面'},
{'text':'手机连数据线插电脑上可以充电不过itunes连接不上'},
{'text':'需要企业VI设计请联系我们'},
{'text':'用过p7用过mate7高配之后'},
{'text':'宝贝要继续加油14806我在'},
{'text':'我永远无法辨别事实的真相和他们的一面之词相差多远'},
{'text':'要求必须是真爱粉有意愿提前很久排队'},
{'text':'丢下xxx万元支票和六千元的LV包'},
{'text':'山西证券上半年净利xx亿同比增逾四倍'},
{'text':'腾讯暂定win10升级服务'},
{'text':'唯有爱与美食不可辜负总有一天一个人喜欢吃的东西会变成两个人喜欢吃的东西然后两个人一起吃遍天下美食~吳貝貝'},
{'text':'简单健康又好玩~有小伙伴要一起跑步刷红包的吗'},
{'text':'言艺术、英语单词拼读记忆…课后作业辅导班、一对一vip皇牌辅导等…多种课程供您选择！ 为庆祝我校区成立一周年，小班课程超低价回馈老学员'},
{'text':'对于机器人还是只停留在想想的阶段吗'},
{'text':'这栋19层高大楼担当重要角色'},
{'text':'从而复制它们的RNA基因组'},
{'text':'姐您好，亮马桥燕莎娇兰专柜三八节超值活动:满xxxx返xxx，满xxxx元赠送xxxx会员积分，即赠送xx倍防晒隔离一支(价值xxx元，由会员中心赠送)，您还会获得高阶赠品一套。期待您三八节前来到专柜，再次祝您节日快乐！––美容顾问小史'},]

assert len(labels) == len(texts)
preds = model.predict_all(texts)
# tData = dataset.get_all_data()
# preds = model.predict_all(tData[0])
#
# y_test = []
# for label in tData[1]:
#     y_test.append(label['label'])
#
rCount = 0.0
print(labels)
print(preds)
for i in range(0,len(preds)):
    if preds[i] == labels[i]:
        rCount += 1.
#
test_acc = rCount / len(preds)
#
print('accuracy %g' % test_acc)